app/Models/AdminInputModel.php

    public function tampilkan_data() {
        return $this
        ->db
        ->table($this->table)
        ->get()
        ->getResult();
---
SELECT *
FROM `admin`

    public function fetch_data($nrp) {
        return $this
        ->where('nrp', $nrp)
        ->first();
---
SELECT *
FROM `admin`
WHERE `nrp` = 'C14220061'
 LIMIT 1

    public function edit_data($data) {
        return $this
        ->set([
            'nama' => $data['nama'],
        ])
        ->where('nrp', $data['nrp'])
        ->update();
---
UPDATE `admin` SET `nama` = 'lalala'
WHERE `nrp` = 'C14220061'